app/controllers/empresas_controller.rb

SELECT `empresas`.* FROM `empresas`
---
  def index
    @empresas = Empresa.all

SELECT `empresas`.* FROM `empresas` WHERE `empresas`.`id` = 1 LIMIT 1
---
  def show
    @empresa = Empresa.find(params[:id])

SELECT `empresas`.* FROM `empresas` WHERE `empresas`.`id` = 1 LIMIT 1
---
  def edit
    @empresa = Empresa.find(params[:id])

INSERT INTO `empresas` (`created_at`, `nome`, `updated_at`) VALUES ('2015-05-17 19:14:24', 'Superintendência de Tecnologia da Informação (STI)', '2015-05-17 19:14:24')
---
  def create
    binding.pry
    @empresa = Empresa.new(params[:empresa])

    respond_to do |format|
      if @empresa.save

SELECT `empresas`.* FROM `empresas` WHERE `empresas`.`id` = 1 LIMIT 1
UPDATE `empresas` SET `nome` = 'Superintendência da Tecnologia da Informação (STI)', `updated_at` = '2015-05-17 19:19:21' WHERE `empresas`.`id` = 1
---
  def update
    @empresa = Empresa.find(params[:id])

    respond_to do |format|
      if @empresa.update_attributes(params[:empresa])