app/controllers/usuarios_controller.rb

SELECT `usuarios`.* FROM `usuarios` WHERE `usuarios`.`id` = 0 LIMIT 1
---
  def show
    @usuario = Usuario.find(params[:id])

INSERT INTO `usuarios` (`administrador`, `created_at`, `email`, `nome`, `senha`, `updated_at`, `verificado`) VALUES (NULL, '2015-05-24 01:02:02', NULL, NULL, NULL, '2015-05-24 01:02:02', NULL)
---
  def create
    @usuario = Usuario.new(params[:usuario])

      if @usuario.save